Revit 2027 API
BuiltInFailures.WallFailures.ContFootingRadiusTooSmall Property
 Can't display the Wall Foundation, because the Wall's radius is too small. Please increase the radius to display the Wall Foundation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContFootingRadiusTooSmall { get; }
Public Shared ReadOnly Property ContFootingRadiusTooSmall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContFootingRadiusTooSmall {
	FailureDefinitionId^ get ();
}
static member ContFootingRadiusTooSmall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace